In [1]:
import numpy as np
import pandas as pd

In [2]:
# read our data
student_perf = pd.read_csv('./data/StudentsPerformance.csv')
student_perf.columns = student_perf.columns.str.replace(" ", "_")

In [3]:
student_perf.shape

(1000, 8)

In [4]:
pd.melt(student_perf, id_vars='gender', value_vars=['writing_score', 'reading_score'])

      gender       variable  value
0     female  writing_score     74
1     female  writing_score     88
2     female  writing_score     93
3       male  writing_score     44
4       male  writing_score     75
...      ...            ...    ...
1995  female  reading_score     99
1996    male  reading_score     55
1997  female  reading_score     71
1998  female  reading_score     78
1999  female  reading_score     86

[2000 rows x 3 columns]

In [5]:
pd.pivot(student_perf, columns='gender')

       race/ethnicity          parental_level_of_education  \
gender         female     male                      female
0             group B      NaN           bachelor's degree
1             group C      NaN                some college
2             group B      NaN             master's degree
3                 NaN  group A                         NaN
4                 NaN  group C                         NaN
..                ...      ...                         ...
995           group E      NaN             master's degree
996               NaN  group C                         NaN
997           group C      NaN                 high school
998           group D      NaN                some college
999           group D      NaN                some college

                                   lunch                \
gender                male        female          male
0                      NaN      standard           NaN
1                      NaN      standard           NaN
2                      NaN      standard           NaN
3       associate's degree           NaN  free/reduced
4             some college           NaN      standard
..                     ...           ...           ...
995                    NaN      standard           NaN
996            high school           NaN  free/reduced
997                    NaN  free/reduced           NaN
998                    NaN      standard           NaN
999                    NaN  free/reduced           NaN

       test_preparation_course       math_score       reading_score        \
gender                  female  male     female  male        female  male
0                         none   NaN       72.0   NaN          72.0   NaN
1                    completed   NaN       69.0   NaN          90.0   NaN
2                         none   NaN       90.0   NaN          95.0   NaN
3                          NaN  none        NaN  47.0           NaN  57.0
4                          NaN  none        NaN  76.0           NaN  78.0
..                         ...   ...        ...   ...           ...   ...
995                  completed   NaN       88.0   NaN          99.0   NaN
996                        NaN  none        NaN  62.0           NaN  55.0
997                  completed   NaN       59.0   NaN          71.0   NaN
998                  completed   NaN       68.0   NaN          78.0   NaN
999                       none   NaN       77.0   NaN          86.0   NaN

       writing_score
gender        female  male
0               74.0   NaN
1               88.0   NaN
2               93.0   NaN
3                NaN  44.0
4                NaN  75.0
..               ...   ...
995             95.0   NaN
996              NaN  55.0
997             65.0   NaN
998             77.0   NaN
999             86.0   NaN

[1000 rows x 14 columns]

In [6]:
# replace whitespace with _ in columns

In [7]:
student_perf.shape

(1000, 8)

In [8]:
# group by gender
score_columns = student_perf.columns[student_perf.columns.str.endswith("_score")]
grouped = student_perf.groupby(by="gender")[score_columns].mean()

In [9]:
student_perf.groupby(by='gender')[score_columns].mean()

        math_score  reading_score  writing_score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [10]:
score_columns = student_perf.columns[student_perf.columns.str.endswith("_score")]

In [11]:
grouped

        math_score  reading_score  writing_score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [12]:
# group by gender and parental_level_of_education

multiindex_group = student_perf.groupby(by=["gender", "parental_level_of_education"])[score_columns].mean()

In [13]:
student_perf.groupby(by=["gender", "parental_level_of_education"])[score_columns].mean()

                                    math_score  reading_score  writing_score
gender parental_level_of_education
female associate's degree            65.250000      74.120690      74.000000
       bachelor's degree             68.349206      77.285714      78.380952
       high school                   59.351064      68.202128      66.691489
       master's degree               66.500000      76.805556      77.638889
       some college                  65.406780      73.550847      74.050847
       some high school              59.296703      69.109890      68.285714
male   associate's degree            70.764151      67.433962      65.405660
       bachelor's degree             70.581818      68.090909      67.654545
       high school                   64.705882      61.480392      58.539216
       master's degree               74.826087      73.130435      72.608696
       some college                  69.009259      64.990741      63.148148
       some high school              67.840909      64.693182      61.375000